<a href="https://colab.research.google.com/github/Sanvee0306/Assignments_DS/blob/main/Assign_3_Hypothesis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [20]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats
import scipy.stats as stats

In [2]:
BuyerRatio = pd.read_csv("/content/BuyerRatio.csv")

In [3]:
BuyerRatio

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [4]:
BuyerRatio.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [ ]:
stats.f_oneway(BuyerRatio.East, BuyerRatio.West,BuyerRatio.North,BuyerRatio.South)

F_onewayResult(statistic=0.3068565327605033, pvalue=0.8204060154887464)

In [ ]:
#Here, P Value > Alfa.  Accept Null Hypothesis, Hence Average are same.
#As per results we can say that there is proportion of male and female buying is similar.

In [6]:
COF = pd.read_csv("/content/Costomer+OrderForm.csv")

In [7]:
COF

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [71]:
dummy = pd.get_dummies(COF['Phillippines'])

In [40]:
dummy = pd.get_dummies(COF['Indonesia'])

In [41]:
dummy = pd.get_dummies(COF['Malta'])

In [42]:
dummy = pd.get_dummies(COF['India'])

In [43]:
dummy

     Defective  Error Free
0            0           1
1            1           0
2            0           1
3            0           1
4            0           1
..         ...         ...
295          0           1
296          0           1
297          0           1
298          0           1
299          0           1

[300 rows x 2 columns]

In [44]:
COF.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [45]:
stats.f_oneway(dummy.iloc[:,0], dummy.iloc[:,1])

F_onewayResult(statistic=1804.6785714285716, pvalue=9.571135321205332e-183)

In [46]:
# As per results we can say that all the canters are EQUAL.

In [47]:
faltoons = pd.read_csv("/content/Faltoons.csv")

In [48]:
faltoons

    Weekdays Weekend
0       Male  Female
1     Female    Male
2     Female    Male
3       Male  Female
4     Female  Female
..       ...     ...
395   Female    Male
396   Female  Female
397   Female  Female
398   Female    Male
399   Female  Female

[400 rows x 2 columns]

In [49]:
faltoons.describe()

       Weekdays Weekend
count       400     400
unique        2       2
top      Female  Female
freq        287     233

In [50]:
stats.t.ppf(0.975,399)

1.965927295920809

In [51]:

stats.t.cdf(0.975,399)

0.8349245027562247

In [66]:
dummy_1 = pd.get_dummies(faltoons['Weekdays'],faltoons['Weekend'])

In [63]:
dummy_1 = pd.get_dummies(faltoons['Weekend'])

In [67]:
dummy_1

     0      Female\n1        Male\n2        Male\n3      Female\n4      Female\n        ...  \n395      Male\n396    Female\n397    Female\n398      Male\n399    Female\nName: Weekend, Length: 400, dtype: object_Female  0      Female\n1        Male\n2        Male\n3      Female\n4      Female\n        ...  \n395      Male\n396    Female\n397    Female\n398      Male\n399    Female\nName: Weekend, Length: 400, dtype: object_Male
0                                                    0                                                                                                                                                                                                                      1
1                                                    1                                                                                                                                                                                                                      0
2                                                    1                                                                                                                                                                                                                      0
3                                                    0                                                                                                                                                                                                                      1
4                                                    1                                                                                                                                                                                                                      0
..                                                 ...                                                                                                                                                                                                                    ...
395                                                  1                                                                                                                                                                                                                      0
396                                                  1                                                                                                                                                                                                                      0
397                                                  1                                                                                                                                                                                                                      0
398                                                  1                                                                                                                                                                                                                      0
399                                                  1                                                                                                                                                                                                                      0

[400 rows x 2 columns]

In [65]:
stats.f_oneway(dummy_1.iloc[:,0], dummy_1.iloc[:,1])

F_onewayResult(statistic=22.333581763511603, pvalue=2.7080949149956605e-06)

In [ ]:
# As per results Proportion of male vs female in weekdays = Proportion of male vs female in weekends.